<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/*
|--------------------------------------------------------------------------
| Папка с изображениями
|--------------------------------------------------------------------------
*/
$config['cms_gallery_dir'] = '/public/upload/gallery/';

/*
|--------------------------------------------------------------------------
| Макеты галерей и размеры изображений
|--------------------------------------------------------------------------
*/
$config['cms_gallery_views'] = array(
    '1' => array(
        'file'  => 'gallery_index',
        'name'  => 'Слайдер',
        'img'   => array(
            '_thumb' => array(
                'width'     => 150,
                'height'    => 0,
                'class'     => '',
                'rel'       => ''
            ),
            '_big' => array(
                'width'     => 750,
                'height'    => 400,
                'class'     => '',
                'rel'       => ''
            )
        )
    )
);