<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/*
|--------------------------------------------------------------------------
| Кол-во новостей для вывода в ленту
|--------------------------------------------------------------------------
*/
$config['cms_news_limit'] = 3;

/*
|--------------------------------------------------------------------------
| Папка с изображениями для новостей
|--------------------------------------------------------------------------
*/
$config['cms_news_dir'] = '/public/upload/news/';

/*
|--------------------------------------------------------------------------
| Размеры изображений
|--------------------------------------------------------------------------
*/
$config['cms_news_images'] = array(
    '_thumb' => array(
        'width'     => 300,
        'height'    => 0
    ),
    '_big' => array(
        'width'     => 1140,
        'height'    => 250
    )
);

/*
|--------------------------------------------------------------------------
| Макеты лент
|--------------------------------------------------------------------------
*/
$config['cms_news_views'] = array(
    '1' => array(
        'file'  => 'news_list_default',
        'name'  => 'Базовый макет ленты новостей'
    )
);