<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

/*
|--------------------------------------------------------------------------
| Папка с баннерами
|--------------------------------------------------------------------------
*/
$config['cms_banners_dir'] = '/public/upload/special/';

/*
|--------------------------------------------------------------------------
| Макеты
|--------------------------------------------------------------------------
*/

$config['cms_banners_views'] = array(
    '1' => array(
        'name'      => 'По умолчанию',
        'view'      => 'banner_default' // макет баннера
    )
);

/*
|--------------------------------------------------------------------------
| Места размещения баннеров
|--------------------------------------------------------------------------
*/
$config['cms_banners_places'] = array(
    '1' => array(
        'name'      => 'Первый баннер под большим слайдером на главной',
        'list'      => false,
        'class'     => false,
        'view'      => 'banner_xxx' // макет списка
    )
);